examples/PilotDC-2/0.org/A
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version  2.0;
    format   ascii;
    class    volVectorField;
    location "0";
    object   A;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [1 1 -2 0 0 -1 0];
internalField uniform (0 0 0);
boundaryField
{
    cathode
    {
        type directionMixed;
        refValue uniform (0 0 0);
        refGradient uniform (0 0 0);
        valueFraction uniform
        (
            1
            0
            0
            0
            0
            1
        );
    }
    anode
    {
        type directionMixed;
        refValue uniform (0 0 0);
        refGradient uniform (0 0 0);
        valueFraction uniform
        (
            1
            0
            0
            0
            0
            1
        );
    }
    electrodewalls
    {
        type directionMixed;
        refValue uniform (0 0 0);
        refGradient uniform (0 0 0);
        valueFraction uniform
        (
            1
            0
            0
            0
            0
            1
        );
    }
    top
    {
        type directionMixed;
        refValue uniform (0 0 0);
        refGradient uniform (0 0 0);
        valueFraction uniform
        (
            1
            0
            0
            0
            0
            1
        );
    }
    sides
    {
        type directionMixed;
        refValue uniform (0 0 0);
        refGradient uniform (0 0 0);
        valueFraction uniform
        (
            1
            0
            0
            0
            0
            1
        );
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
