examples/PilotDC-2/0.org/ePot
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version  2.0;
    format   ascii;
    class    volScalarField;
    location "0";
    object   ePot;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [1 2 -3 0 0 -1 0];
internalField uniform 0;
boundaryField
{
    cathode
    {
        type fixedCurrentDensity;
        currentDensity uniform -20000000.0;
        value uniform 0;
    }
    anode
    {
        type fixedValue;
        value uniform 0;
    }
    electrodewalls
    {
        type zeroGradient;
    }
    top
    {
        type zeroGradient;
    }
    sides
    {
        type zeroGradient;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
