examples/PilotDC-2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    location "system";
    object   controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application plasmaArc;
startFrom latestTime;
startTime 0;
stopAt endTime;
endTime 0.025;
deltaT 1e-08;
writeControl adjustableRunTime;
writeInterval 0.001;
purgeWrite 0;
writeFormat ascii;
writePrecision 8;
writeCompression off;
timeFormat general;
timePrecision 8;
runTimeModifiable true;
adjustTimeStep on;
maxCo 0.5;
maxAlphaCo 0.5;
minDeltaT 0;
maxDeltaT 1;
libs
(
    "libcompressibleFluidLut.so"
    "libfixedCurrentDensity.so"
    "liblimitedTemperature.so"
);
functions
{
    voltage_cathode
    {
        type surfaceFieldValue;
        libs
        (
            libfieldFunctionObjects
        );
        fields
        (
            ePot
        );
        operation min;
        regionType patch;
        name cathode;
        log false;
        writeFields false;
        executeControl timeStep;
        executeInterval 10;
        writeControl timeStep;
        writeInterval 10;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
