examples/PilotDC-2/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default     Euler;
}

gradSchemes
{
    default     Gauss linear;
}

divSchemes
{
    default                                         none;
    div(phi,U)                                      Gauss limitedLinearV 1;
    div(((rho*nuEff)*dev2(T(grad(U)))))             Gauss linear;
    div(phi,K)                                      Gauss linear;
    div(phi,h)                                      Gauss upwind;
    div((ek*(U^B)))                                 Gauss linear;
    div(((constantET*interpolate((j|Cp)))&S),h)     Gauss linear;
}

laplacianSchemes
{
    default     Gauss linear corrected;
}

interpolationSchemes
{
    default     linear;
}

snGradSchemes
{
    default     corrected;
}

fluxRequired
{
    p;
}


// ************************************************************************* //
